"""Test data for 70 kg tournament"""

# 1. Пронумеровываем спортсменов после жеребьёвки (порядок в первом туре).
names = {
    1: "Блинов",
    2: "Веденеев",
    3: "Марков",
    4: "Удасев",
    5: "Нигматов",
    6: "Рождайкин",
    7: "Карасев",
    8: "Працков",
    9: "Мантров",
    10: "Вишняков",
    11: "Бойцов",
    12: "Караичев",
    13: "Дмитриев",
    14: "Новиков",
    15: "Дунаев",
    16: "Шадымов",
    17: "Бройдо",
}

# 2. Представляем турнир (сетку) как набор пар (n[i],n[j]), где n[j] победил n[i]
# format data: list(tuple(str, str)), left - winner, right - looser
# if person has no pair, than as a winner pair, looks like ("", "Fam
pairs = [
    # first tour
    ("Бойцов", "Карасев"),
    ("Шадымов", "Працков"),
    ("Дмитриев", "Веденеев"),
    ("Нигматов", "Удасев"),
    ("Бройдо", "Марков"),
    ("Караичев", "Вишняков"),
    ("Мантров", "Рождайкин"),
    ("Дунаев", "Блинов"),
    ("", "Новиков"),
    # second tour
    ("Новиков", "Карасев"),
    ("Працков", "Веденеев"),
    ("Удасев", "Марков"),
    ("Вишняков", "Рождайкин"),
    ("", "Блинов"),
    ("Шадымов", "Бойцов"),
    ("Дмитриев", "Нигматов"),
    ("Бройдо", "Караичев"),
    ("Дунаев", "Мантров"),
    # third tour
    ("Карасев", "Блинов"),
    ("Марков", "Веденеев"),
    ("", "Рождайкин"),
    ("Новиков", "Працков"),
    ("Вишняков", "Удасев"),
    ("Бойцов", "Нигматов"),
    ("Караичев", "Мантров"),
    # forth tour
    ("Рождайкин", "Блинов"),
    ("", "Веденеев"),
    ("Карасев", "Марков"),
    ("Працков", "Удасев"),
    ("Мантров", "Нигматов"),
    # fifth tour
    ("Веденеев", "Блинов"),
    ("Рождайкин", "Марков"),
    ("Нигматов", "Удасев"),
    # semi final
    ("Марков", "Веденеев"),
    # final
    ("Веденеев", "Блинов"),
    # match for 5-6 places
    ("Рождайкин", "Нигматов"),
]

# wights are optional
weights = {
    "Блинов": 66.0,
    "Веденеев": 67.4,
    "Марков": 67.7,
    "Удасев": 69.2,
    "Нигматов": 67.2,
    "Рождайкин": 66.2,
    "Карасев": 69.8,
    "Мантров": 63.9,
    "Вишняков": 67.0,
    "Працков": 64.7,
    "Бойцов": 70.0,
    "Караичев": 60.5,
    "Дмитриев": 65.0,
    "Новиков": 62.5,
    "Шадымов": 70.0,
    "Дунаев": 65.7,
    "Бройдо": 70.0,
}
