"""Test data for 75 kg tournament"""

# 1. Пронумеровываем спортсменов после жеребьёвки (порядок в первом туре).
names = {
    1: "Болдырев",
    2: "Савченко",
    3: "Гринев",
    4: "Дубиненков",
    5: "Шутов",
    6: "Аверьянов",
    7: "Баданин",
    8: "Бабошин",
    9: "Пухов",
    10: "Даудов",
    11: "Веденеев",
    12: "Карасев",
    13: "Секирин",
    14: "Орлов",
    15: "Заробеков",
    16: "Бойцов",
    17: "Колосов",
    18: "Оганесов",
    19: "Кочугаев",
    20: "Дашков",
}


# 2. Представляем турнир (сетку) как набор пар (n[i],n[j]), где n[j] победил n[i]
# format data: list(tuple(str, str)), left - winner, right - looser
# if person has no pair, than as a winner pair, looks like ("", "Family")
pairs = [
    # first tour
    ("Карасев", "Гринев"),
    ("Оганесов", "Савченко"),
    ("Даудов", "Веденеев"),
    ("Колосов", "Шутов"),
    ("Дашков", "Болдырев"),
    ("Заробеков", "Секирин"),
    ("Кочугаев", "Пухов"),
    ("Орлов", "Баданин"),
    ("Бабошин", "Дубиненков"),
    ("Бойцов", "Аверьянов"),
    # second tour
    ("Гринев", "Савченко"),
    ("Веденеев", "Шутов"),
    ("Секирин", "Болдырев"),
    ("Баданин", "Пухов"),
    ("Аверьянов", "Дубиненков"),
    ("Оганесов", "Карасев"),
    ("Колосов", "Даудов"),
    ("Дашков", "Заробеков"),
    ("Кочугаев", "Орлов"),
    ("Бойцов", "Бабошин"),
    # third tour
    ("Шутов", "Савченко"),
    ("Пухов", "Болдырев"),
    ("", "Дубиненков"),
    ("Веденеев", "Гринев"),
    ("Секирин", "Баданин"),
    ("Карасев", "Аверьянов"),
    ("Заробеков", "Даудов"),
    ("Орлов", "Бабошин"),
    # forth tour
    ("Дубиненков", "Савченко"),
    ("", "Болдырев"),
    ("Пухов", "Шутов"),
    ("Баданин", "Гринев"),
    ("Даудов", "Аверьянов"),
    ("", "Бабошин"),
    # fifth tour
    ("Савченко", "Болдырев"),
    ("Бабошин", "Дубиненков"),
    ("Шутов", "Гринев"),
    ("", "Аверьянов"),
    # sixth tour
    ("Аверьянов", "Дубиненков"),
    ("", "Гринев"),
    # seventh tour
    ("Дубиненков", "Гринев"),
    # semi final
    ("Гринев", "Савченко"),
    # final
    ("Савченко", "Болдырев"),
    # match for 5-6 places
    ("Аверьянов", "Шутов"),
    # superfinal
    ("Савченко", "Болдырев"),
]


# wights are optional
weights = {
}